       1:      1  1 CALL pred neg_conj:main/2-0 (det) neg_conj.m:11
mdb> echo on
Command echo enabled.
mdb> break p
Registering debuggable procedures... done.
There is one debuggable module, with 4 procedures.
 0: + stop  interface pred neg_conj:p/1-0 (semidet)
mdb> continue
       3:      2  2 CALL pred neg_conj:p/1-0 (semidet) neg_conj.m:19 (neg_conj.m:9)
mdb> finish
      18:      2  2 EXIT pred neg_conj:p/1-0 (semidet) neg_conj.m:19 (neg_conj.m:9)
mdb> dd
atom("p", [univ(0 : int)])
Valid? no
atom("q", [univ(0 : int), univ(0 : int)])
Valid? yes
Call atom("r", [univ(0 : int)])
Solutions:
Complete? yes
atom("q", [univ(0 : int), univ(1 : int)])
Valid? yes
Call atom("r", [univ(1 : int)])
Solutions:
Complete? yes
Call atom("q", [univ(0 : int)])
Solutions:
	atom("q", [univ(0 : int), univ(0 : int)])
	atom("q", [univ(0 : int), univ(1 : int)])
Complete? yes
Incorrect node found:
wrong_answer(atom("p", [univ(0 : int)]))
      18:      2  2 EXIT pred neg_conj:p/1-0 (semidet) neg_conj.m:19 (neg_conj.m:9)
mdb> continue
yes.
