       1:      1  1 CALL pred queens:main/2-0 (cc_multi) queens.m:17
mdb> echo on
Command echo enabled.
mdb> dd
mdb: declarative debugging is only available from EXIT or FAIL events.
mdb> break queen
Registering debuggable procedures... done.
There is one debuggable module, with 9 procedures.
 0: + stop  interface pred queens:queen/2-0 (nondet)
mdb> continue
       5:      3  2 CALL pred queens:queen/2-0 (nondet) queens.m:41 (queens.m:15)
mdb> finish
     161:      3  2 FAIL pred queens:queen/2-0 (nondet) queens.m:41 (queens.m:15)
mdb> dd
Call atom("queen", [univ([1, 2, 3, 4, 5] : list:list(int))])
Solutions:
Complete? no
Call atom("qperm", [univ([1, 2, 3, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
Solutions:
Complete? no
atom("qdelete", [univ(4 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 2, 3, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
Valid? yes
atom("qdelete", [univ(5 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 2, 3, 4] : list:list(int)), univ(int : private_builtin:type_info(int))])
Valid? yes
Call atom("qdelete", [univ([1, 2, 3, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
Solutions:
	atom("qdelete", [univ(1 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([2, 3, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
	atom("qdelete", [univ(2 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 3, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
	atom("qdelete", [univ(3 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 2, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
	atom("qdelete", [univ(4 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 2, 3, 5] : list:list(int)), univ(int : private_builtin:type_info(int))])
	atom("qdelete", [univ(5 : int), univ([1, 2, 3, 4, 5] : list:list(int)), univ([1, 2, 3, 4] : list:list(int)), univ(int : private_builtin:type_info(int))])
Complete? yes
Incorrect node found:
missing_answer(atom("qperm", [univ([1, 2, 3, 4, 5] : list:list(int)), univ(int : private_builtin:type_info(int))]), [])
     161:      3  2 FAIL pred queens:queen/2-0 (nondet) queens.m:41 (queens.m:15)
mdb> continue
No solution
