       1:      1  1 CALL pred completion.main/2-0 (det) completion.m:13
mdb> echo on
echo on
Command echo enabled.
mdb> register --quiet
register --quiet
mdb> 
?                  delete             io_query           return
P                  disable            label_stats        s
alias              document           level              save
all_class_decls    document_category  maxdepth           scope
all_regs           down               mindepth           scroll
all_type_ctors     e                  mm_stacks          set
b                  echo               mmc_options        source
break              enable             modules            stack
browse             exception          next               stack_regs
c                  excp               nondet_stack       step
cc_query           f                  p                  subgoal
class_decl         finish             pneg_stack         table
clear_histogram    flag               print              table_io
consumer           forward            print_optionals    term_size
context            g                  printlevel         type_ctor
continue           gen_stack          proc_stats         unalias
current            goto               procedures         unhide_events
cut_stack          h                  query              up
d                  help               quit               v
dd                 histogram_all      r                  vars
dd_dd              histogram_exp      register           view
debug_vars         ignore             retry              
mdb> h
h              help           histogram_all  histogram_exp  
mdb> help v
vars  view  
mdb> help vars 
help vars 
vars
     Prints the names of all the known variables in the current
     environment, together with an ordinal number for each variable.
mdb> p --flat 
*          --pretty   -f         -v         exception  
--flat     --verbose  -p         DCG_0      goal       
mdb> p --flat DCG_0 
p --flat DCG_0 
       DCG_0 (arg 1)          	state('<<c_pointer>>')
mdb> sta
stack       stack_regs  
mdb> stack --detailed 
stack --detailed 
   0       1       1    1 pred completion.main/2-0 (det) (completion.m:13) (empty)
mdb> proc
proc_stats  procedures  
mdb> procedures complet
completion            completion.sub2       
completion.sub1       completion.sub2.sub3  
mdb> procedures completion.
completion.sub1       completion.sub2       completion.sub2.sub3
mdb> procedures completion.sub1
procedures completion.sub1
List of procedures in module `completion.sub1'
pred completion.sub1.zp/1-0 (det)
func completion.sub1.z1/0-0 (det)
mdb> set --flat format pretty 
set --flat format pretty 
mdb> unalias excp 
unalias excp 
Alias `excp' removed.
mdb> b zabc3 
b zabc3 
 0: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> b func*complet
func*completion.            func*completion.sub2.
func*completion.sub1.       func*completion.sub2.sub3.
mdb> b func*completion.z
func*completion.z   func*completion.zz  
mdb> b func*completion.z
b func*completion.z
 1: + stop  interface func completion.z/0-0 (det)
mdb> b complet
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
mdb> b completion.s
completion.sub1.       completion.sub2.       completion.sub2.sub3.
mdb> b completion.sub1
completion.sub1.z1  completion.sub1.zp  
mdb> b completion.sub1.z1
b completion.sub1.z1
 2: + stop  interface func completion.sub1.z1/0-0 (det)
mdb> b complet
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
mdb> b completion.s
completion.sub1.       completion.sub2.       completion.sub2.sub3.
mdb> b completion.sub2
completion.sub2.       completion.sub2.sub3.  
mdb> b completion.sub2.sub3.zabc3 
b completion.sub2.sub3.zabc3 
 3: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 2d
2d                  2debug_vars         2document
2dd                 2delete             2document_category
2dd_dd              2disable            2down
mdb> 2de
2debug_vars  2delete      
mdb> 2delete 
2delete 
 2: E stop  interface func completion.sub1.z1/0-0 (det)
mdb> c
c
ok
