       1:      1  1 CALL pred completion.main/2-0 (det) completion.m:13
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> 
?                    enable               quit
P                    exception            r
alias                excp                 register
all_class_decls      f                    retry
all_procedures       finish               return
all_regs             flag                 s
all_type_ctors       forward              save
b                    g                    save_to_file
break                gen_stack            scope
break_print          goal_paths           scroll
browse               goto                 set
c                    h                    source
cc_query             held_vars            stack
class_decl           help                 stack_default_limit
clear_histogram      histogram_all        stack_regs
condition            histogram_exp        stats
consumer             hold                 step
context              ignore               subgoal
continue             io_query             table
current              level                table_io
cut_stack            maxdepth             term_size
d                    mindepth             trust
dd                   mm_stacks            trusted
dd_dd                mmc_options          type_ctor
debug_vars           modules              unalias
delete               next                 unhide_events
dice                 nondet_stack         untrust
diff                 p                    up
disable              pneg_stack           v
document             print                var_details
document_category    print_optionals      vars
down                 printlevel           view
e                    procedures           
echo                 query                
h              help           histogram_exp  
held_vars      histogram_all  hold           
var_details  vars         view         
var_details  vars         
 help vars 
vars
     Prints the names of all the known variables in the current
     environment, together with an ordinal number for each variable.
mdb> 
*          --pretty   -f         -v         goal       
--flat     --verbose  -p         exception  
p --flat D
mdb: there is no such variable.
mdb> 
stack                stack_default_limit  stack_regs
stack --detailed 
   0       1       1    1 pred completion.main/2-0 (det) (completion.m:13) (empty)
mdb> 
completion            completion.sub2       
completion.sub1       completion.sub2.sub3  
completion.sub1       completion.sub2       completion.sub2.sub3
procedures completion.sub1
List of procedures in module `completion.sub1'
pred completion.sub1.zp/1-0 (det)
func completion.sub1.z1/0-0 (det)
mdb> set --flat format pretty 
mdb> unalias excp 
Alias `excp' removed.
mdb> b zabc3 
 0: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
func*completion.            func*completion.sub2.
func*completion.sub1.       func*completion.sub2.sub3.
func*completion.z   func*completion.zz  
b func*completion.z
 1: + stop  interface func completion.z/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub1.z1  completion.sub1.zp  
b completion.sub1.z1
 2: + stop  interface func completion.sub1.z1/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub2.       completion.sub2.sub3.  
b completion.sub2.sub3.zabc3 
 3: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
2d                  2delete             2document
2dd                 2dice               2document_category
2dd_dd              2diff               2down
2debug_vars         2disable            
2debug_vars  2delete      
2delete 
 2: E stop  interface func completion.sub1.z1/0-0 (det)
mdb> c
ok
