       1:      1  1 CALL pred completion.main/2-0 (det) completion.m:13
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> 
?                    excp                 quit
P                    f                    r
alias                finish               register
all_class_decls      flag                 retry
all_procedures       forward              return
all_regs             g                    s
all_type_ctors       gen_stack            save
b                    goal_paths           save_to_file
break                goto                 scope
browse               h                    scroll
c                    help                 set
cc_query             histogram_all        source
class_decl           histogram_exp        stack
clear_histogram      ignore               stack_default_limit
consumer             io_query             stack_regs
context              label_stats          step
continue             level                subgoal
current              maxdepth             table
cut_stack            mindepth             table_io
d                    mm_stacks            term_size
dd                   mmc_options          trust
dd_dd                modules              trusted
debug_vars           next                 type_ctor
delete               nondet_stack         unalias
disable              p                    unhide_events
document             pneg_stack           untrust
document_category    print                up
down                 print_optionals      v
e                    printlevel           var_details
echo                 proc_stats           var_name_stats
enable               procedures           vars
exception            query                view
h              help           histogram_all  histogram_exp  
var_details     var_name_stats  vars            view
var_details     var_name_stats  vars            
 help vars 
vars
     Prints the names of all the known variables in the current
     environment, together with an ordinal number for each variable.
mdb> 
*          --pretty   -f         -v         goal       
--flat     --verbose  -p         exception  
p --flat D
mdb: there is no such variable.
mdb> 
stack                stack_default_limit  stack_regs
stack --detailed 
   0       1       1    1 pred completion.main/2-0 (det) (completion.m:13) (empty)
mdb> 
proc_stats  procedures  
completion            completion.sub2       
completion.sub1       completion.sub2.sub3  
completion.sub1       completion.sub2       completion.sub2.sub3
procedures completion.sub1
List of procedures in module `completion.sub1'
pred completion.sub1.zp/1-0 (det)
func completion.sub1.z1/0-0 (det)
mdb> set --flat format pretty 
mdb> unalias excp 
Alias `excp' removed.
mdb> b zabc3 
 0: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
func*completion.            func*completion.sub2.
func*completion.sub1.       func*completion.sub2.sub3.
func*completion.z   func*completion.zz  
b func*completion.z
 1: + stop  interface func completion.z/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub1.z1  completion.sub1.zp  
b completion.sub1.z1
 2: + stop  interface func completion.sub1.z1/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub2.       completion.sub2.sub3.  
b completion.sub2.sub3.zabc3 
 3: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
2d                  2debug_vars         2document
2dd                 2delete             2document_category
2dd_dd              2disable            2down
2debug_vars  2delete      
2delete 
 2: E stop  interface func completion.sub1.z1/0-0 (det)
mdb> c
ok
