       1:      1  1 CALL pred completion.main/2-0 (det) completion.m:13
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> 
?                    enable               query
P                    exception            quit
alias                excp                 r
all_class_decls      f                    register
all_procedures       finish               retry
all_regs             flag                 return
all_type_ctors       forward              s
b                    g                    save
break                gen_stack            save_to_file
break_print          goal_paths           scope
browse               goto                 scroll
c                    h                    set
cc_query             held_vars            source
class_decl           help                 stack
clear_histogram      histogram_all        stack_default_limit
condition            histogram_exp        stack_regs
consumer             hold                 stats
context              ignore               step
continue             io_query             subgoal
current              level                table
cut_stack            maxdepth             table_io
d                    mindepth             term_size
dd                   mm_stacks            trust
debug_vars           mmc_options          trusted
delete               modules              type_ctor
dice                 next                 unalias
diff                 nondet_stack         unhide_events
disable              p                    untrust
document             pneg_stack           up
document_category    print                v
down                 print_optionals      var_details
e                    printlevel           vars
echo                 procedures           view
h              help           histogram_exp  
held_vars      histogram_all  hold           
var_details  vars         view         
var_details  vars         
 help vars 
vars
     Prints the names of all the known variables in the current
     environment, together with an ordinal number for each variable.
mdb> 
*          --pretty   -f         -v         goal       
--flat     --verbose  -p         exception  
p --flat D
mdb: there is no such variable.
mdb> 
stack                stack_default_limit  stack_regs
stack --detailed 
   0       1       1    1 pred completion.main/2-0 (det) (completion.m:13) (empty)
mdb> 
completion            completion.sub2       
completion.sub1       completion.sub2.sub3  
completion.sub1       completion.sub2       completion.sub2.sub3
procedures completion.sub1
List of procedures in module `completion.sub1'
pred completion.sub1.zp/1-0 (det)
func completion.sub1.z1/0-0 (det)
mdb> set --flat format pretty 
mdb> unalias excp 
Alias `excp' removed.
mdb> b zabc3 
 0: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
func*completion.            func*completion.sub2.
func*completion.sub1.       func*completion.sub2.sub3.
func*completion.z   func*completion.zz  
b func*completion.z
 1: + stop  interface func completion.z/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub1.z1  completion.sub1.zp  
b completion.sub1.z1
 2: + stop  interface func completion.sub1.z1/0-0 (det)
mdb> 
completion.            completion.sub2.       
completion.sub1.       completion.sub2.sub3.  
completion.sub1.       completion.sub2.       completion.sub2.sub3.
completion.sub2.       completion.sub2.sub3.  
b completion.sub2.sub3.zabc3 
 3: + stop  interface func completion.sub2.sub3.zabc3/0-0 (det)
mdb> 
2d                  2dice               2document_category
2dd                 2diff               2down
2debug_vars         2disable            
2delete             2document           
2debug_vars  2delete      
2delete 
 2: E stop  interface func completion.sub1.z1/0-0 (det)
mdb> c
ok
